{
  "metadata": {
    "total_parameters": 8182606130,
    "total_size": 32122400968
  },
  "weight_map": {
    "grounding_encoder.sam2_model.image_encoder.neck.convs.0.conv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.neck.convs.0.conv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.neck.convs.1.conv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.neck.convs.1.conv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.neck.convs.2.conv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.neck.convs.2.conv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.neck.convs.3.conv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.neck.convs.3.conv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.0.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.0.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.0.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.0.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.0.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.0.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.0.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.0.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.0.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.0.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.0.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.0.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.1.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.1.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.1.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.1.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.1.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.1.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.1.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.1.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.1.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.1.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.1.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.1.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.10.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.10.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.10.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.10.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.10.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.10.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.10.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.10.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.10.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.10.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.10.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.10.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.11.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.11.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.11.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.11.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.11.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.11.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.11.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.11.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.11.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.11.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.11.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.11.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.12.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.12.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.12.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.12.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.12.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.12.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.12.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.12.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.12.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.12.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.12.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.12.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.13.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.13.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.13.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.13.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.13.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.13.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.13.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.13.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.13.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.13.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.13.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.13.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.14.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.14.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.14.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.14.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.14.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.14.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.14.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.14.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.14.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.14.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.14.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.14.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.15.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.15.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.15.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.15.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.15.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.15.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.15.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.15.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.15.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.15.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.15.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.15.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.16.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.16.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.16.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.16.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.16.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.16.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.16.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.16.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.16.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.16.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.16.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.16.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.17.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.17.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.17.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.17.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.17.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.17.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.17.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.17.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.17.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.17.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.17.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.17.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.18.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.18.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.18.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.18.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.18.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.18.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.18.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.18.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.18.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.18.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.18.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.18.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.19.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.19.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.19.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.19.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.19.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.19.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.19.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.19.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.19.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.19.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.19.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.19.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.2.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.2.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.2.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.2.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.2.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.2.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.2.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.2.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.2.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.2.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.2.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.2.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.2.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.2.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.20.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.20.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.20.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.20.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.20.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.20.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.20.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.20.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.20.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.20.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.20.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.20.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.21.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.21.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.21.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.21.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.21.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.21.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.21.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.21.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.21.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.21.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.21.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.21.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.22.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.22.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.22.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.22.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.22.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.22.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.22.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.22.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.22.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.22.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.22.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.22.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.23.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.23.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.23.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.23.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.23.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.23.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.23.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.23.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.23.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.23.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.23.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.23.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.24.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.24.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.24.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.24.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.24.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.24.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.24.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.24.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.24.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.24.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.24.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.24.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.25.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.25.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.25.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.25.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.25.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.25.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.25.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.25.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.25.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.25.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.25.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.25.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.26.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.26.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.26.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.26.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.26.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.26.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.26.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.26.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.26.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.26.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.26.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.26.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.27.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.27.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.27.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.27.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.27.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.27.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.27.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.27.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.27.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.27.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.27.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.27.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.28.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.28.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.28.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.28.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.28.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.28.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.28.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.28.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.28.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.28.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.28.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.28.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.29.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.29.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.29.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.29.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.29.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.29.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.29.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.29.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.29.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.29.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.29.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.29.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.3.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.3.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.3.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.3.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.3.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.3.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.3.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.3.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.3.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.3.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.3.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.3.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.30.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.30.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.30.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.30.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.30.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.30.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.30.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.30.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.30.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.30.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.30.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.30.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.31.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.31.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.31.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.31.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.31.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.31.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.31.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.31.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.31.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.31.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.31.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.31.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.32.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.32.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.32.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.32.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.32.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.32.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.32.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.32.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.32.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.32.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.32.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.32.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.33.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.33.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.33.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.33.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.33.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.33.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.33.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.33.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.33.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.33.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.33.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.33.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.34.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.34.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.34.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.34.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.34.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.34.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.34.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.34.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.34.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.34.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.34.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.34.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.35.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.35.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.35.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.35.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.35.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.35.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.35.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.35.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.35.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.35.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.35.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.35.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.36.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.36.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.36.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.36.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.36.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.36.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.36.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.36.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.36.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.36.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.36.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.36.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.37.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.37.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.37.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.37.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.37.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.37.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.37.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.37.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.37.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.37.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.37.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.37.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.38.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.38.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.38.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.38.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.38.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.38.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.38.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.38.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.38.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.38.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.38.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.38.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.39.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.39.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.39.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.39.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.39.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.39.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.39.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.39.mlp.layers.1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.39.norm1.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.39.norm1.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.39.norm2.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.39.norm2.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.4.attn.proj.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.4.attn.proj.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.4.attn.qkv.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.4.attn.qkv.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.4.mlp.layers.0.bias": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.4.mlp.layers.0.weight": "model-00007-of-00007.safetensors",
    "grounding_encoder.sam2_model.image_encoder.trunk.blocks.4.mlp.layers.1.bias": "model-00007-of-00007.safetensors",
